Binary classification is the problem of predicting the class a
given sample belongs to. To achieve a good prediction
performance, it is important to find a suitable model for a
given dataset. However, it is often time consuming and
impractical for practitioners to try various classification
models because each model employs a different formulation and
algorithm. The difficulty can be mitigated if we have a unified
formulation and an efficient universal algorithmic framework for
various classification models to expedite the comparison of
performance of different models for a given dataset. In this
paper, we present a unified formulation of various
classification models (including $C$-SVM, $\ell_2$-SVM,
$\nu$-SVM, MM-FDA, MM-MPM, logistic regression, distance
weighted discrimination) and develop a general optimization
algorithm based on an accelerated proximal gradient (APG) method
for the formulation. We design various techniques such as
backtracking line search and adaptive restarting strategy in
order to speed up the practical convergence of our method. We
also give a theoretical convergence guarantee for the proposed
fast APG algorithm. Numerical experiments show that our
algorithm is stable and highly competitive to specialized
algorithms designed for specific models (e.g., sequential
minimal optimization (SMO) for SVM).

[4, 1, []]
[4, 1, []]
[7, 2, []]
[9, 2, []]
[15, 1, ["Binary classification is the problem of predicting the class a given sample belongs to", "However, it is often time consuming and impractical for practitioners to try various classification models because each model employs a different formulation and algorithm", "The difficulty can be mitigated if we have a unified formulation and an efficient universal algorithmic framework for various classification models to expedite the comparison of performance of different models for a given dataset", "In this paper, we present a unified formulation of various classification models (including $C$-SVM, $\\ell_2$-SVM, $\\nu$-SVM, MM-FDA, MM-MPM, logistic regression, distance weighted discrimination) and develop a general optimization algorithm based on an accelerated proximal gradient (APG) method for the formulation", "We design various techniques such as backtracking line search and adaptive restarting strategy in order to speed up the practical convergence of our method", "We also give a theoretical convergence guarantee for the proposed fast APG algorithm", "Numerical experiments show that our algorithm is stable and highly competitive to specialized algorithms designed for specific models (e", ", sequential minimal optimization (SMO) for SVM)"]]
[9, 2, []]
[3, 2, []]
[4, 1, []]
[0, 2, []]
[1, 2, []]
