We consider the problem of low canonical polyadic (CP) rank
tensor completion. A completion is a tensor whose entries agree
with the observed entries and its rank matches the given CP
rank. We analyze the manifold structure corresponding to the
tensors with the given rank and define a set of polynomials
based on the sampling pattern and CP decomposition. Then, we
show that finite completability of the sampled tensor is
equivalent to having a certain number of algebraically
independent polynomials among the defined polynomials. Our
proposed approach results in characterizing the maximum number
of algebraically independent polynomials in terms of a simple
geometric structure of the sampling pattern, and therefore we
obtain the deterministic necessary and sufficient condition on
the sampling pattern for finite completability of the sampled
tensor. Moreover, assuming that the entries of the tensor are
sampled independently with probability $p$ and using the
mentioned deterministic analysis, we propose a combinatorial
method to derive a lower bound on the sampling probability $p$,
or equivalently, the number of sampled entries that guarantees
finite completability with high probability. We also show that
the existing result for the matrix completion problem can be
used to obtain a loose lower bound on the sampling probability
$p$. In addition, we obtain deterministic and probabilistic
conditions for unique completability. It is seen that the number
of samples required for finite or unique completability obtained
by the proposed analysis on the CP manifold is orders-of-
magnitude lower than that is obtained by the existing analysis
on the Grassmannian manifold.

[5, 2, []]
[6, 2, []]
[8, 2, []]
[5, 2, []]
[13, 1, ["We consider the problem of low canonical polyadic (CP) rank tensor completion", "A completion is a tensor whose entries agree with the observed entries and its rank matches the given CP rank", "We analyze the manifold structure corresponding to the tensors with the given rank and define a set of polynomials based on the sampling pattern and CP decomposition", "Then, we show that finite completability of the sampled tensor is equivalent to having a certain number of algebraically independent polynomials among the defined polynomials", "Our proposed approach results in characterizing the maximum number of algebraically independent polynomials in terms of a simple geometric structure of the sampling pattern, and therefore we obtain the deterministic necessary and sufficient condition on the sampling pattern for finite completability of the sampled tensor", "Moreover, assuming that the entries of the tensor are sampled independently with probability $p$ and using the mentioned deterministic analysis, we propose a combinatorial method to derive a lower bound on the sampling probability $p$, or equivalently, the number of sampled entries that guarantees finite completability with high probability", "In addition, we obtain deterministic and probabilistic conditions for unique completability", "It is seen that the number of samples required for finite or unique completability obtained by the proposed analysis on the CP manifold is orders-of- magnitude lower than that is obtained by the existing analysis on the Grassmannian manifold"]]
[12, 2, []]
[6, 2, []]
[3, 2, []]
[9, 2, []]
