Large-scale data containing multiple important rare clusters,
even at moderately high dimensions, pose challenges for existing
clustering methods. To address this issue, we propose a new
mixture model called Hidden Markov Model on Variable Blocks
(HMM-VB) and a new mode search algorithm called Modal Baum-Welch
(MBW) for mode-association clustering. HMM-VB leverages prior
information about chain-like dependence among groups of
variables to achieve the effect of dimension reduction. In case
such a dependence structure is unknown or assumed merely for the
sake of parsimonious modeling, we develop a recursive search
algorithm based on BIC to optimize the formation of ordered
variable blocks. The MBW algorithm ensures the feasibility of
clustering via mode association, achieving linear complexity in
terms of the number of variable blocks despite the exponentially
growing number of possible state sequences in HMM-VB. In
addition, we provide theoretical investigations about the
identifiability of HMM-VB as well as the consistency of our
approach to search for the block partition of variables in a
special case. Experiments on simulated and real data show that
our proposed method outperforms other widely used methods.

[6, 2, []]
[10, 2, []]
[9, 1, []]
[9, 1, []]
[11, 1, ["To address this issue, we propose a new mixture model called Hidden Markov Model on Variable Blocks (HMM-VB) and a new mode search algorithm called Modal Baum-Welch (MBW) for mode-association clustering", "In case such a dependence structure is unknown or assumed merely for the sake of parsimonious modeling, we develop a recursive search algorithm based on BIC to optimize the formation of ordered variable blocks", "The MBW algorithm ensures the feasibility of clustering via mode association, achieving linear complexity in terms of the number of variable blocks despite the exponentially growing number of possible state sequences in HMM-VB"]]
[9, 1, ["HMM-VB leverages prior information about chain-like dependence among groups of variables to achieve the effect of dimension reduction", "In addition, we provide theoretical investigations about the identifiability of HMM-VB as well as the consistency of our approach to search for the block partition of variables in a special case"]]
[5, 2, []]
