Motivated by applications in neuroimaging analysis, we propose a
new regression model, Sparse TensOr REsponse regression (STORE),
with a tensor response and a vector predictor. STORE embeds two
key sparse structures: element-wise sparsity and low-rankness.
It can handle both a non-symmetric and a symmetric tensor
response, and thus is applicable to both structural and
functional neuroimaging data. We formulate the parameter
estimation as a non-convex optimization problem, and develop an
efficient alternating updating algorithm. We establish a non-
asymptotic estimation error bound for the actual estimator
obtained from the proposed algorithm. This error bound reveals
an interesting interaction between the computational efficiency
and the statistical rate of convergence. When the distribution
of the error tensor is Gaussian, we further obtain a fast
estimation error rate which allows the tensor dimension to grow
exponentially with the sample size. We illustrate the efficacy
of our model through intensive simulations and an analysis of
the Autism spectrum disorder neuroimaging data.

[9, 2, []]
[4, 2, []]
[4, 2, []]
[7, 2, []]
[4, 2, []]
[5, 2, []]
[10, 1, ["Motivated by applications in neuroimaging analysis, we propose a new regression model, Sparse TensOr REsponse regression (STORE), with a tensor response and a vector predictor", "It can handle both a non-symmetric and a symmetric tensor response, and thus is applicable to both structural and functional neuroimaging data", "We formulate the parameter estimation as a non-convex optimization problem, and develop an efficient alternating updating algorithm", "We establish a non- asymptotic estimation error bound for the actual estimator obtained from the proposed algorithm", "This error bound reveals an interesting interaction between the computational efficiency and the statistical rate of convergence", "When the distribution of the error tensor is Gaussian, we further obtain a fast estimation error rate which allows the tensor dimension to grow exponentially with the sample size"]]
[8, 1, ["We illustrate the efficacy of our model through intensive simulations and an analysis of the Autism spectrum disorder neuroimaging data"]]
